Revit 2026 API

# RebarConstraintIsValidSurfaceToConstraintHandleTo Method

---

Checks if the surface can be used to create a constraint to it for the input handle.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsValidSurfaceToConstraintHandleTo(
	RebarConstrainedHandle handle,
	Surface surface
)
```
```vb
Public Shared Function IsValidSurfaceToConstraintHandleTo (
	handle As RebarConstrainedHandle,
	surface As Surface
) As Boolean
```
```cpp
public:
static bool IsValidSurfaceToConstraintHandleTo(
	RebarConstrainedHandle^ handle,
	Surface^ surface
)
```
```fsharp
static member IsValidSurfaceToConstraintHandleTo :
        handle : RebarConstrainedHandle *
        surface : Surface -> bool
```

#### Parameters

handle RebarConstrainedHandle
     The handle of the rebar that will be constrained.
surface Surface
     The surface that will be tested.

#### Return Value

Boolean Returns true if the surface can be used to create a constraint to it for the input handle.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

If the handle belongs to a free from rebar will return false.

If the input plane is almost perpendicular (the angle between surfaces is between 84 or 96 degrees) will return false.

If the input handle is Rebar Plane or Out Of Plane Extents and the surface isn't a plane will return false.

If the input handle is a segment of a bar whose shape has a RebarShapeDefinitionBySegments definition and the surface isn't a cylinder surface will return false.

For any other cases will return true

#### Reference

RebarConstraint Class

Autodesk.Revit.DB.Structure Namespace